#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.covid_lambda_package will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "covid_lambda_package"  {
      + excludes            = [
          + "Pipfile",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../etl"
      + type                = "zip"
    }

  # aws_cloudwatch_event_rule.daily_trigger will be created
  + resource "aws_cloudwatch_event_rule" "daily_trigger" {
      + arn                 = (known after apply)
      + description         = "Run covid etl lambda every day at 10AM UTC"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "daily-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.five_minute_trigger will be created
  + resource "aws_cloudwatch_event_rule" "five_minute_trigger" {
      + arn                 = (known after apply)
      + description         = "Run covid etl lambda every 5 minutes"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "five-minute-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.covid_etl_every_day will be created
  + resource "aws_cloudwatch_event_target" "covid_etl_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "daily-trigger"
      + target_id      = "covid_etl_lambda"
    }

  # aws_cloudwatch_event_target.covid_etl_every_five_minutes will be created
  + resource "aws_cloudwatch_event_target" "covid_etl_every_five_minutes" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "five-minute-trigger"
      + target_id      = "covid_etl_lambda"
    }

  # aws_dynamodb_table.covid-db will be created
  + resource "aws_dynamodb_table" "covid-db" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "date"
      + id               = (known after apply)
      + name             = "CovidData"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "date"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_role.covid_etl_lambda_role will be created
  + resource "aws_iam_role" "covid_etl_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "covid-etl-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.covid_etl_lambda_role_log_policy will be created
  + resource "aws_iam_role_policy" "covid_etl_lambda_role_log_policy" {
      + id     = (known after apply)
      + name   = "CovidETLLambdaRolePolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.covid_etl_lambda_role_sns_policy will be created
  + resource "aws_iam_role_policy" "covid_etl_lambda_role_sns_policy" {
      + id     = (known after apply)
      + name   = "CovidETLAllowSNSPermissions"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_lambda_function.covid_etl_lambda_func will be created
  + resource "aws_lambda_function" "covid_etl_lambda_func" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = (known after apply)
      + function_name                  = "covid_etl_lambda_function"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:336392948345:layer:AWSDataWrangler-Python39:1",
        ]
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DYNAMO_TABLE_NAME" = "CovidData"
              + "SNS_ARN"           = "arn:aws:sns:us-east-1:564804858012:covid-table-updated"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_covid_etl will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_covid_etl" {
      + action        = "lambda:InvokeFunction"
      + function_name = "covid_etl_lambda_function"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_sns_topic.covid_table_updated will be created
  + resource "aws_sns_topic" "covid_table_updated" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "covid-table-updated"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic_subscription.covid_etl_updated will be created
  + resource "aws_sns_topic_subscription" "covid_etl_updated" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "norman@nshipman.io"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # random_uuid.lambda_src_hash will be created
  + resource "random_uuid" "lambda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "__init__.py"      = "d41d8cd98f00b204e9800998ecf8427e"
          + "dynamo.py"        = "34ffa39f897d3f4280b4dfd038c2d601"
          + "main.py"          = "8a07571513d00668deb2f98c428a0703"
          + "notifications.py" = "29ce610df418a211aca9ef562561f2fe"
          + "requirements.txt" = "65ab916c3373deb4adcb2986f813cee8"
          + "transform.py"     = "4cac43a9446a07d1f985f96d15cc6956"
        }
      + result  = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @nshipman-io, Action: `pull_request`*